zoubata/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA



menu.cpu=Microcontroller
menu.clock=Clock Source
menu.usb=USB Config
menu.ros=ROS Option

menu.debugboard=debug board option
#menu.com=Communications
menu.serial=Serial Config
menu.bootloader=Bootloader Size
# ZoubWorld Pilo rev A0
Pilo.name=zoubworld Pilo (rev A0)(SAM-BA bootloader)
Pilo.vid.0=0x2a03
Pilo.pid.0=0x004d
Pilo.vid.1=0x2a03
Pilo.pid.1=0x804d
Pilo.vid.2=0x2a03
Pilo.pid.2=0x004e
Pilo.vid.3=0x2a03
Pilo.pid.3=0x804e
Pilo.vid.0=0x16D0
Pilo.pid.0=0x0557
Pilo.vid.1=0x16D0
Pilo.pid.1=0x0856
Pilo.vid.2=0x16D0
Pilo.pid.2=0x0B41
Pilo.vid.3=0x16D0
Pilo.pid.3=0x0B40
Pilo.vid.4=0x16D0
Pilo.pid.4=0x0A0C
Pilo.vid.5=0x16D0
Pilo.pid.5=0x0856
Pilo.build.mcu=cortex-m0plus
Pilo.build.f_cpu=48000000L
Pilo.build.usb_product="Pilo Rev A0"
Pilo.build.usb_manufacturer="Zoubworld"
Pilo.build.board=SAMD_ZERO


Pilo.build.core=arduino
Pilo.build.variant=Pilo
Pilo.build.variant_system_lib=
Pilo.build.vid=0x16D0

Pilo.upload.protocol=sam-ba




Pilo.menu.ros.off=Disabled
Pilo.menu.ros.off.build.rosoption=ROS_NONE
Pilo.menu.ros.debug=ROS1-Melodic
Pilo.menu.ros.debug.build.rosoption=ROS_USED

Pilo.menu.debugboard.normal=Pilo
Pilo.menu.debugboard.normal.build.boardconfig=BOARD_ID_Pilo
Pilo.menu.debugboard.debug=engi
Pilo.menu.debugboard.debug.build.boardconfig=BOARD_ID_engi




Pilo.menu.clock.crystal_32k=32KHZ_CRYSTAL
Pilo.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
#Pilo.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
#Pilo.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
Pilo.menu.clock.internal=INTERNAL_OSCILLATOR
Pilo.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
#Pilo.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
#Pilo.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB


Pilo.menu.cpu.samd21j18a=SAMD21J18A
Pilo.menu.cpu.samd21j18a.bootloader.uploaddevice=ATSAMD21J18
Pilo.menu.cpu.samd21j18a.upload.maximum_size=253952
Pilo.menu.cpu.samd21j18a.build.extra_flags=-D__SAMD21J18A__  {build.usb_flags}
Pilo.menu.cpu.samd21j18a.build.ldscript=flash_256KB.ld
Pilo.menu.cpu.samd21j18a.build.openocdscript=openocd_scripts/SAMD21J18A.cfg
Pilo.menu.cpu.samd21j18a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMD21J18A.bin
Pilo.menu.cpu.samd21j17a=SAMD21J17A
Pilo.menu.cpu.samd21j17a.bootloader.uploaddevice=ATSAMD21J17
Pilo.menu.cpu.samd21j17a.upload.maximum_size=122880
Pilo.menu.cpu.samd21j17a.build.extra_flags=-D__SAMD21J17A__  {build.usb_flags}
Pilo.menu.cpu.samd21j17a.build.ldscript=flash_128KB.ld
Pilo.menu.cpu.samd21j17a.build.openocdscript=openocd_scripts/SAMD21J17A.cfg
Pilo.menu.cpu.samd21j17a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMD21J17A.bin
Pilo.menu.cpu.samd21j16a=SAMD21J16A
Pilo.menu.cpu.samd21j16a.bootloader.uploaddevice=ATSAMD21J16
Pilo.menu.cpu.samd21j16a.upload.maximum_size=57344
Pilo.menu.cpu.samd21j16a.build.extra_flags=-D__SAMD21J16A__  {build.usb_flags}
Pilo.menu.cpu.samd21j16a.build.ldscript=flash_64KB.ld
Pilo.menu.cpu.samd21j16a.build.openocdscript=openocd_scripts/SAMD21J16A.cfg
Pilo.menu.cpu.samd21j16a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMD21J16A.bin
Pilo.menu.cpu.samd21j15a=SAMD21J15A
Pilo.menu.cpu.samd21j15a.bootloader.uploaddevice=ATSAMD21J15
Pilo.menu.cpu.samd21j15a.upload.maximum_size=24576
Pilo.menu.cpu.samd21j15a.build.extra_flags=-D__SAMD21J15A__  {build.usb_flags}
Pilo.menu.cpu.samd21j15a.build.ldscript=flash_32KB.ld
Pilo.menu.cpu.samd21j15a.build.openocdscript=openocd_scripts/SAMD21J15A.cfg
Pilo.menu.cpu.samd21j15a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMD21J15A.bin

Pilo.menu.cpu.samd21j14a=SAMD21J14A
Pilo.menu.cpu.samd21j14a.bootloader.uploaddevice=ATSAMD21J14
Pilo.menu.cpu.samd21j14a.upload.maximum_size=12288
Pilo.menu.cpu.samd21j14a.build.extra_flags=-D__SAMD21J14A__  {build.usb_flags}
Pilo.menu.cpu.samd21j14a.build.ldscript=flash_16KB.ld
Pilo.menu.cpu.samd21j14a.build.openocdscript=openocd_scripts/SAMD21J14A.cfg
Pilo.menu.cpu.samd21j14a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMD21J14A.bin

Pilo.menu.cpu.saml21j18b=SAML21J18B
Pilo.menu.cpu.saml21j18b.bootloader.uploaddevice=ATSAML21J18
Pilo.menu.cpu.saml21j18b.upload.maximum_size=253952
Pilo.menu.cpu.saml21j18b.build.extra_flags=-D__SAML21J18B__   {build.usb_flags}
Pilo.menu.cpu.saml21j18b.build.ldscript=flash_256KB.ld
Pilo.menu.cpu.saml21j18b.build.openocdscript=openocd_scripts/SAML21J18B.cfg
Pilo.menu.cpu.saml21j18b.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAML21J18A.bin
Pilo.menu.cpu.saml21j17b=SAML21J17B
Pilo.menu.cpu.saml21j17b.bootloader.uploaddevice=ATSAML21J17
Pilo.menu.cpu.saml21j17b.upload.maximum_size=122880
Pilo.menu.cpu.saml21j17b.build.extra_flags=-D__SAML21J17B__  {build.usb_flags}
Pilo.menu.cpu.saml21j17b.build.ldscript=flash_128KB.ld
Pilo.menu.cpu.saml21j17b.build.openocdscript=openocd_scripts/SAML21J17B.cfg
Pilo.menu.cpu.saml21j17b.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAML21J17A.bin
Pilo.menu.cpu.saml21j16b=SAML21J16B
Pilo.menu.cpu.saml21j16b.bootloader.uploaddevice=ATSAML21J16
Pilo.menu.cpu.saml21j16b.upload.maximum_size=57344
Pilo.menu.cpu.saml21j16b.build.extra_flags=-D__SAML21J16B__  {build.usb_flags}
Pilo.menu.cpu.saml21j16b.build.ldscript=flash_64KB.ld
Pilo.menu.cpu.saml21j16b.build.openocdscript=openocd_scripts/SAML21J16B.cfg
Pilo.menu.cpu.saml21j16b.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAML21J16A.bin
Pilo.menu.cpu.saml21j15b=SAML21J15B
Pilo.menu.cpu.saml21j15b.bootloader.uploaddevice=ATSAML21J15
Pilo.menu.cpu.saml21j15b.upload.maximum_size=2457624576
Pilo.menu.cpu.saml21j15b.build.extra_flags=-D__SAML21J16B__   {build.usb_flags}
Pilo.menu.cpu.saml21j15b.build.ldscript=flash_32KB.ld
Pilo.menu.cpu.saml21j15b.build.openocdscript=openocd_scripts/SAML21J16B.cfg
Pilo.menu.cpu.saml21j15b.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAML21J16A.bin
Pilo.menu.cpu.samc21j18a=SAMC21J18A
Pilo.menu.cpu.samc21j18a.bootloader.uploaddevice=ATSAMC21J18
Pilo.menu.cpu.samc21j18a.upload.maximum_size=253952
Pilo.menu.cpu.samc21j18a.build.extra_flags=-D__SAMC21J18A__  
Pilo.menu.cpu.samc21j18a.build.ldscript=flash_256KB.ld
Pilo.menu.cpu.samc21j18a.build.openocdscript=openocd_scripts/SAMC21J18A.cfg
Pilo.menu.cpu.samc21j18a.bootloader.file=Pilo/binaries/sam_ba_Pilo_samc21j18a.bin
Pilo.menu.cpu.samc21j17a=SAMC21J17A
Pilo.menu.cpu.samc21j17a.bootloader.uploaddevice=ATSAMC21J17
Pilo.menu.cpu.samc21j17a.upload.maximum_size=122880
Pilo.menu.cpu.samc21j17a.build.extra_flags=-D__SAMC21J17A__ 
Pilo.menu.cpu.samc21j17a.build.ldscript=flash_128KB.ld
Pilo.menu.cpu.samc21j17a.build.openocdscript=openocd_scripts/SAMC21J17A.cfg
Pilo.menu.cpu.samc21j17a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMC21J17A.bin
Pilo.menu.cpu.samc21j16a=SAMC21J16A
Pilo.menu.cpu.samc21j16a.bootloader.uploaddevice=ATSAMC21J16
Pilo.menu.cpu.samc21j16a.upload.maximum_size=57344
Pilo.menu.cpu.samc21j16a.build.extra_flags=-D__SAMC21J16A__ 
Pilo.menu.cpu.samc21j16a.build.ldscript=flash_64KB.ld
Pilo.menu.cpu.samc21j16a.build.openocdscript=openocd_scripts/SAMC21J16A.cfg
Pilo.menu.cpu.samc21j16a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMC21J16A.bin

Pilo.menu.cpu.samc21j15a=SAMC21J15A
Pilo.menu.cpu.samc21j15a.bootloader.uploaddevice=ATSAMC21J15
Pilo.menu.cpu.samc21j15a.upload.maximum_size=24576
Pilo.menu.cpu.samc21j15a.build.extra_flags=-D__SAMC21J15A__  -D__8KB_BOOTLOADER__
Pilo.menu.cpu.samc21j15a.build.ldscript=flash_32KB.ld
Pilo.menu.cpu.samc21j15a.build.openocdscript=openocd_scripts/SAMC21J15A.cfg
Pilo.menu.cpu.samc21j15a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMC21J15A.bin

Pilo.menu.cpu.samd20j18a=SAMD20J18A
Pilo.menu.cpu.samd20j18a.bootloader.uploaddevice=ATSAMD20J18
Pilo.menu.cpu.samd20j18a.upload.maximum_size=253952
Pilo.menu.cpu.samd20j18a.build.extra_flags=-D__SAMD20J18A__ {build.usb_flags} 
Pilo.menu.cpu.samd20j18a.build.ldscript=flash_256KB.ld
Pilo.menu.cpu.samd20j18a.build.openocdscript=openocd_scripts/SAMD20J18A.cfg
Pilo.menu.cpu.samd20j18a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMD20J18A.bin
Pilo.menu.cpu.samd20j17a=SAMD20J17A
Pilo.menu.cpu.samd20j17a.bootloader.uploaddevice=ATSAMD20J17
Pilo.menu.cpu.samd20j17a.upload.maximum_size=122880
Pilo.menu.cpu.samd20j17a.build.extra_flags=-D__SAMD20J17A__ {build.usb_flags} 
Pilo.menu.cpu.samd20j17a.build.ldscript=flash_128KB.ld
Pilo.menu.cpu.samd20j17a.build.openocdscript=openocd_scripts/SAMD20J17A.cfg
Pilo.menu.cpu.samd20j17a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMD20J17A.bin

Pilo.menu.cpu.samd20j16a=SAMD20J16A
Pilo.menu.cpu.samd20j16a.bootloader.uploaddevice=ATSAMD20J16
Pilo.menu.cpu.samd20j16a.upload.maximum_size=57344
Pilo.menu.cpu.samd20j16a.build.extra_flags=-D__SAMD20J16A__ {build.usb_flags} 
Pilo.menu.cpu.samd20j16a.build.ldscript=flash_64KB.ld
Pilo.menu.cpu.samd20j16a.build.openocdscript=openocd_scripts/SAMD20J16A.cfg
Pilo.menu.cpu.samd20j16a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMD20J16A.bin

