zoubata/ArduinoCore-samd/boards.txt
#Pilo.menu.com.uart=UART_ONLY
#Pilo.menu.com.uart.build.board=UART_ONLY
#Pilo.menu.com.uart.build.pid=0x0856
#Pilo.menu.com.none=USB_UART_DISABLED
#Pilo.menu.com.none.build.board=USB_UART_DISABLED
#Pilo.menu.com.none.build.pid=0x0856


Pilo.build.mcu=cortex-m0plus
Pilo.build.f_cpu=48000000L


#Pilo.build.core=arduino
#Pilo.build.variant=Pilo
#Pilo.build.variant_system_lib=
#Pilo.build.vid=0x16D0
#Pilo.bootloader.tool=arduino:openocd
Pilo.bootloader.tool=Jlink

Pilo.upload.tool=bossac
Pilo.upload.protocol=sam-ba
Pilo.upload.use_1200bps_touch=true
Pilo.upload.wait_for_upload_port=true
Pilo.upload.native_usb=true




# ZoubWorld Captor rev A0
Captor.name=zoubworld Captor (rev A0)(SAM-BA bootloader)
Captor.vid.0=0x2a03
Captor.pid.0=0x004d
Captor.vid.1=0x2a03
Captor.pid.1=0x804d
Captor.vid.2=0x2a03
Captor.pid.2=0x004e
Captor.vid.3=0x2a03
Captor.pid.3=0x804e
Captor.vid.0=0x16D0
Captor.pid.0=0x0557
Captor.vid.1=0x16D0
Captor.pid.1=0x0856
Captor.vid.2=0x16D0
Captor.pid.2=0x0B41
Captor.vid.3=0x16D0
Captor.pid.3=0x0B40
Captor.vid.4=0x16D0
Captor.pid.4=0x0A0C
Captor.vid.5=0x16D0
Captor.pid.5=0x0856
Captor.build.mcu=cortex-m0plus
Captor.build.f_cpu=48000000L
Captor.build.usb_product="Captor Rev A0"
Captor.build.usb_manufacturer="Zoubworld"
Captor.build.board=SAMD_ZERO


Captor.build.core=arduino
Captor.build.variant=Captor
Captor.build.variant_system_lib=
Captor.build.vid=0x16D0

Captor.upload.protocol=sam-ba




Captor.menu.debugboard.normal=Captor
Captor.menu.debugboard.normal.build.boardconfig=BOARD_ID_Captor
Captor.menu.debugboard.debug=engi
Captor.menu.debugboard.debug.build.boardconfig=BOARD_ID_engi

Captor.menu.ros.off=Disabled
Captor.menu.ros.off.build.rosoption=NONE
Captor.menu.ros.debug=ROS1-Melodic
Captor.menu.ros.debug.build.rosoption=ROS_USED

#Captor.build.boardconfig=BOARD_ID_Captor
#Captor.menu.clock.internal=INTERNAL_OSCILLATOR
#Captor.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL





Captor.build.clockconfig=CLOCKCONFIG_INTERNAL

Captor.menu.cpu.samc21n18a=SAMC21N18A
Captor.menu.cpu.samc21n18a.bootloader.uploaddevice=ATSAMC21N18
Captor.menu.cpu.samc21n18a.upload.maximum_size=253952
Captor.menu.cpu.samc21n18a.build.extra_flags=-D__SAMC21N18A__  
Captor.menu.cpu.samc21n18a.build.ldscript=flash_256KB.ld
Captor.menu.cpu.samc21n18a.build.openocdscript=openocd_scripts/samc21n18a.cfg
Captor.menu.cpu.samc21n18a.bootloader.file=Pilo/binaries/sam_ba_Captor_samc21n18a.bin

Captor.menu.cpu.samc21n17a=SAMC21N17A
Captor.menu.cpu.samc21n17a.bootloader.uploaddevice=ATSAMC21N17
Captor.menu.cpu.samc21n17a.upload.maximum_size=122880
Captor.menu.cpu.samc21n17a.build.extra_flags=-D__SAMC21N17A__ 
Captor.menu.cpu.samc21n17a.build.ldscript=flash_128KB.ld
Captor.menu.cpu.samc21n17a.build.openocdscript=openocd_scripts/SAMC21N17A.cfg
Captor.menu.cpu.samc21n17a.bootloader.file=Pilo/binaries/sam_ba_Captor_SAMC21N17A.bin

Captor.menu.cpu.samc21n16a=SAMC21N16A
Captor.menu.cpu.samc21n16a.bootloader.uploaddevice=ATSAMC21N16
Captor.menu.cpu.samc21n16a.upload.maximum_size=57344
Captor.menu.cpu.samc21n16a.build.extra_flags=-D__SAMC21N16A__ 
Captor.menu.cpu.samc21n16a.build.ldscript=flash_64KB.ld
Captor.menu.cpu.samc21n16a.build.openocdscript=openocd_scripts/SAMC21N16A.cfg
Captor.menu.cpu.samc21n16a.bootloader.file=Pilo/binaries/sam_ba_Captor_SAMC21N16A.bin

Captor.menu.cpu.samc21n15a=SAMC21N15A
Captor.menu.cpu.samc21n15a.bootloader.uploaddevice=ATSAMC21N15
Captor.menu.cpu.samc21n15a.upload.maximum_size=24576
Captor.menu.cpu.samc21n15a.build.extra_flags=-D__SAMC21N15A__  -D__8KB_BOOTLOADER__
Captor.menu.cpu.samc21n15a.build.ldscript=flash_32KB.ld
Captor.menu.cpu.samc21n15a.build.openocdscript=openocd_scripts/SAMC21N15A.cfg
Captor.menu.cpu.samc21n15a.bootloader.file=Pilo/binaries/sam_ba_Captor_SAMC21N15A.bin



Captor.menu.bootloader.4kb=4KB_BOOTLOADER
Captor.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
Captor.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
Captor.menu.bootloader.4kb.upload.tool=bossac
Captor.menu.bootloader.4kb.upload.use_1200bps_touch=true
Captor.menu.bootloader.4kb.upload.wait_for_upload_port=true
Captor.menu.bootloader.4kb.upload.native_usb=false

Captor.menu.bootloader.8kb=8KB_BOOTLOADER
Captor.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
Captor.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
Captor.menu.bootloader.8kb.upload.tool=bossac
Captor.menu.bootloader.8kb.upload.use_1200bps_touch=true
Captor.menu.bootloader.8kb.upload.wait_for_upload_port=true
Captor.menu.bootloader.8kb.upload.native_usb=true

Captor.menu.bootloader.16kb=16KB_BOOTLOADER
Captor.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
Captor.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
Captor.menu.bootloader.16kb.upload.tool=bossac
Captor.menu.bootloader.16kb.upload.use_1200bps_touch=true
Captor.menu.bootloader.16kb.upload.wait_for_upload_port=true
Captor.menu.bootloader.16kb.upload.native_usb=true

Captor.menu.bootloader.0kb=NO_BOOTLOADER
Captor.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
Captor.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
Captor.menu.bootloader.0kb.upload.tool=Jlink
Captor.menu.bootloader.0kb.upload.use_1200bps_touch=false
Captor.menu.bootloader.0kb.upload.wait_for_upload_port=false
Captor.menu.bootloader.0kb.upload.native_usb=false

#Captor.menu.usb.cdc=CDC_ONLY
#Captor.menu.usb.cdc.build.usbcom=CDC_ONLY
#Captor.menu.usb.cdc.build.pid=0x0557
#Captor.menu.usb.cdc_hid=CDC_HID
#Captor.menu.usb.cdc_hid.build.usbcom=CDC_HID
#Captor.menu.usb.cdc_hid.build.pid=0x0856
#Captor.menu.usb.withcdc=WITH_CDC
#Captor.menu.usb.withcdc.build.usbcom=WITH_CDC
#Captor.menu.usb.withcdc.build.pid=0x0B41
#Captor.menu.usb.hid=HID_ONLY
#Captor.menu.usb.hid.build.usbcom=HID_ONLY
#Captor.menu.usb.hid.build.pid=0x0B40
#Captor.menu.usb.nocdc=WITHOUT_CDC
#Captor.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
#Captor.menu.usb.nocdc.build.pid=0x0A0C
#Captor.menu.usb.none=USB_DISABLED
#Captor.menu.usb.none.build.usbcom=USB_DISABLED
#Captor.menu.usb.none.build.pid=0x0856

#Captor.menu.com.cdc_uart=CDC_UART
#Captor.menu.com.cdc_uart.build.board=CDC_UART
#Captor.menu.com.cdc_uart.build.pid=0x0557
#Captor.menu.com.cdc_hid_uart=CDC_HID_UART
#Captor.menu.com.cdc_hid_uart.build.board=CDC_HID_UART
#Captor.menu.com.cdc_hid_uart.build.pid=0x0856
#Captor.menu.com.cdc_hid=CDC_HID
#Captor.menu.com.cdc_hid.build.board=CDC_HID
#Captor.menu.com.cdc_hid.build.pid=0x0856
#Captor.menu.com.cdc=CDC_ONLY
#Captor.menu.com.cdc.build.board=CDC_ONLY
#Captor.menu.com.cdc.build.pid=0x0557
#Captor.menu.com.cdc_midi_hid_uart=CDC_MIDI_HID_UART
#Captor.menu.com.cdc_midi_hid_uart.build.board=CDC_MIDI_HID_UART
#Captor.menu.com.cdc_midi_hid_uart.build.pid=0x0B34




#Captor.menu.serial.default_uart_wire_spi=DEFAULT(captor)
#Captor.menu.serial.default_uart_wire_spi.build.serialcom_uart=SIX_UART
#Captor.menu.serial.default_uart_wire_spi.build.serialcom_wire=ONE_WIRE
#Captor.menu.serial.default_uart_wire_spi.build.serialcom_spi=TWO_SPI


Captor.build.serialcom_uart=SIX_UART
Captor.build.serialcom_wire=ONE_WIRE
Captor.build.serialcom_spi=TWO_SPI


