zoubata/ArduinoCore-samd/boards.txt
#Captor.menu.usb.none=USB_DISABLED
#Captor.menu.usb.none.build.usbcom=USB_DISABLED
#Captor.menu.usb.none.build.pid=0x0856

Captor.build.usbcom=USB_DISABLED
  

Captor.build.mcu=cortex-m0plus
Captor.build.f_cpu=48000000L


Captor.bootloader.tool=Jlink

Captor.upload.tool=bossac
Captor.upload.protocol=sam-ba
Captor.upload.use_1200bps_touch=true
Captor.upload.wait_for_upload_port=true
Captor.upload.native_usb=true




























# ZoubWorld Line rev A0
Line.name=zoubworld Line (rev A0)(SAM-BA bootloader)
Line.vid.0=0x2a03
Line.pid.0=0x004d
Line.vid.1=0x2a03
Line.pid.1=0x804d
Line.vid.2=0x2a03
Line.pid.2=0x004e
Line.vid.3=0x2a03
Line.pid.3=0x804e
Line.vid.0=0x16D0
Line.pid.0=0x0557
Line.vid.1=0x16D0
Line.pid.1=0x0856
Line.vid.2=0x16D0
Line.pid.2=0x0B41
Line.vid.3=0x16D0
Line.pid.3=0x0B40
Line.vid.4=0x16D0
Line.pid.4=0x0A0C
Line.vid.5=0x16D0
Line.pid.5=0x0856
Line.build.mcu=cortex-m0plus
Line.build.f_cpu=48000000L
Line.build.usb_product="Line Rev A0"
Line.build.usb_manufacturer="Zoubworld"
Line.build.board=SAMD_ZERO


Line.build.core=arduino
Line.build.variant=Line
Line.build.variant_system_lib=
Line.build.vid=0x16D0

Line.upload.protocol=sam-ba





Line.menu.ros.off=Disabled
Line.menu.ros.off.build.rosoption=NONE
Line.menu.ros.debug=ROS1-Melodic
Line.menu.ros.debug.build.rosoption=ROS_USED


#Line.menu.debugboard.normal=Line
#Line.menu.debugboard.normal.build.boardconfig=BOARD_ID_Line
#Line.menu.debugboard.debug=engi
#Line.menu.debugboard.debug.build.boardconfig=BOARD_ID_engi
Line.build.boardconfig=BOARD_ID_Line

#Line.menu.clock.internal=INTERNAL_OSCILLATOR
#Line.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
Line.build.clockconfig=CLOCKCONFIG_INTERNAL


Line.menu.cpu.samd21e18a=SAMD21E18A
Line.menu.cpu.samd21e18a.bootloader.uploaddevice=ATSAMD21E18
Line.menu.cpu.samd21e18a.upload.maximum_size=253952
Line.menu.cpu.samd21e18a.build.extra_flags=-D__SAMD21E18A__  
Line.menu.cpu.samd21e18a.build.ldscript=flash_256KB.ld
Line.menu.cpu.samd21e18a.build.openocdscript=openocd_scripts/samd21e18a.cfg
Line.menu.cpu.samd21e18a.bootloader.file=Pilo/binaries/sam_ba_Line_samd21e18a.bin

Line.menu.cpu.samd21e17a=SAMD21E17A
Line.menu.cpu.samd21e17a.bootloader.uploaddevice=ATSAMD21E17
Line.menu.cpu.samd21e17a.upload.maximum_size=122880
Line.menu.cpu.samd21e17a.build.extra_flags=-D__SAMD21E17A__ 
Line.menu.cpu.samd21e17a.build.ldscript=flash_128KB.ld
Line.menu.cpu.samd21e17a.build.openocdscript=openocd_scripts/SAMD21E17A.cfg
Line.menu.cpu.samd21e17a.bootloader.file=Pilo/binaries/sam_ba_Line_SAMD21E17A.bin

Line.menu.cpu.samd21e16a=SAMD21E16A
Line.menu.cpu.samd21e16a.bootloader.uploaddevice=ATSAMD21E16
Line.menu.cpu.samd21e16a.upload.maximum_size=57344
Line.menu.cpu.samd21e16a.build.extra_flags=-D__SAMD21E16A__ 
Line.menu.cpu.samd21e16a.build.ldscript=flash_64KB.ld
Line.menu.cpu.samd21e16a.build.openocdscript=openocd_scripts/SAMD21E16A.cfg
Line.menu.cpu.samd21e16a.bootloader.file=Pilo/binaries/sam_ba_Line_SAMD21E16A.bin

Line.menu.cpu.samd21e15a=SAMD21E15A
Line.menu.cpu.samd21e15a.bootloader.uploaddevice=ATSAMD21E15
Line.menu.cpu.samd21e15a.upload.maximum_size=24576
Line.menu.cpu.samd21e15a.build.extra_flags=-D__SAMD21E15A__ 
Line.menu.cpu.samd21e15a.build.ldscript=flash_32KB.ld
Line.menu.cpu.samd21e15a.build.openocdscript=openocd_scripts/SAMD21E15A.cfg
Line.menu.cpu.samd21e15a.bootloader.file=Pilo/binaries/sam_ba_Line_SAMD21E15A.bin


Line.menu.cpu.samd20e18a=SAMD20E18A
Line.menu.cpu.samd20e18a.bootloader.uploaddevice=ATSAMD20E18
Line.menu.cpu.samd20e18a.upload.maximum_size=253952
Line.menu.cpu.samd20e18a.build.extra_flags=-D__SAMD20E18__  
Line.menu.cpu.samd20e18a.build.ldscript=flash_256KB.ld
Line.menu.cpu.samd20e18a.build.openocdscript=openocd_scripts/samd20e18a.cfg
Line.menu.cpu.samd20e18a.bootloader.file=Pilo/binaries/sam_ba_Line_samd20e18a.bin

Line.menu.cpu.samd20e17a=SAMD20E17A
Line.menu.cpu.samd20e17a.bootloader.uploaddevice=ATSAMD20E17
Line.menu.cpu.samd20e17a.upload.maximum_size=122880
Line.menu.cpu.samd20e17a.build.extra_flags=-D__SAMD20E17__ 
Line.menu.cpu.samd20e17a.build.ldscript=flash_128KB.ld
Line.menu.cpu.samd20e17a.build.openocdscript=openocd_scripts/SAMD20E17A.cfg
Line.menu.cpu.samd20e17a.bootloader.file=Pilo/binaries/sam_ba_Line_SAMD20E17A.bin

Line.menu.cpu.samd20e16a=SAMD20E16A
Line.menu.cpu.samd20e16a.bootloader.uploaddevice=ATSAMD20E16
Line.menu.cpu.samd20e16a.upload.maximum_size=57344
Line.menu.cpu.samd20e16a.build.extra_flags=-D__SAMD20E16__ 
Line.menu.cpu.samd20e16a.build.ldscript=flash_64KB.ld
Line.menu.cpu.samd20e16a.build.openocdscript=openocd_scripts/SAMD20E16A.cfg
Line.menu.cpu.samd20e16a.bootloader.file=Pilo/binaries/sam_ba_Line_SAMD20E16A.bin

Line.menu.cpu.samd20e15a=SAMD20E15A
Line.menu.cpu.samd20e15a.bootloader.uploaddevice=ATSAMD20E15
Line.menu.cpu.samd20e15a.upload.maximum_size=24576
Line.menu.cpu.samd20e15a.build.extra_flags=-D__SAMD20E15__ 
Line.menu.cpu.samd20e15a.build.ldscript=flash_32KB.ld
Line.menu.cpu.samd20e15a.build.openocdscript=openocd_scripts/SAMD20E15A.cfg
Line.menu.cpu.samd20e15a.bootloader.file=Pilo/binaries/sam_ba_Line_SAMD20E15A.bin




Line.menu.bootloader.4kb=4KB_BOOTLOADER
Line.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
Line.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
Line.menu.bootloader.4kb.upload.tool=bossac
Line.menu.bootloader.4kb.upload.use_1200bps_touch=true
Line.menu.bootloader.4kb.upload.wait_for_upload_port=true
Line.menu.bootloader.4kb.upload.native_usb=false

Line.menu.bootloader.8kb=8KB_BOOTLOADER
Line.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
Line.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
Line.menu.bootloader.8kb.upload.tool=bossac
Line.menu.bootloader.8kb.upload.use_1200bps_touch=true
Line.menu.bootloader.8kb.upload.wait_for_upload_port=true
Line.menu.bootloader.8kb.upload.native_usb=true

Line.menu.bootloader.16kb=16KB_BOOTLOADER
Line.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
Line.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
Line.menu.bootloader.16kb.upload.tool=bossac
Line.menu.bootloader.16kb.upload.use_1200bps_touch=true
Line.menu.bootloader.16kb.upload.wait_for_upload_port=true
Line.menu.bootloader.16kb.upload.native_usb=true

Line.menu.bootloader.0kb=NO_BOOTLOADER
Line.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
Line.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
Line.menu.bootloader.0kb.upload.tool=Jlink
Line.menu.bootloader.0kb.upload.use_1200bps_touch=false
Line.menu.bootloader.0kb.upload.wait_for_upload_port=false
Line.menu.bootloader.0kb.upload.native_usb=false

