zoubata/ArduinoCore-samd/boards.txt
Line.menu.usb.cdc=CDC_ONLY
Line.menu.usb.cdc.build.usbcom=CDC_ONLY
Line.menu.usb.cdc.build.pid=0x0557
Line.menu.usb.cdc_hid=CDC_HID
Line.menu.usb.cdc_hid.build.usbcom=CDC_HID
Line.menu.usb.cdc_hid.build.pid=0x0856
Line.menu.usb.withcdc=WITH_CDC
Line.menu.usb.withcdc.build.usbcom=WITH_CDC
Line.menu.usb.withcdc.build.pid=0x0B41
Line.menu.usb.hid=HID_ONLY
Line.menu.usb.hid.build.usbcom=HID_ONLY
Line.menu.usb.hid.build.pid=0x0B40
Line.menu.usb.nocdc=WITHOUT_CDC
Line.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
Line.menu.usb.nocdc.build.pid=0x0A0C
Line.menu.usb.none=USB_DISABLED
Line.menu.usb.none.build.usbcom=USB_DISABLED
Line.menu.usb.none.build.pid=0x0856

Line.menu.com.cdc_uart=CDC_UART
Line.menu.com.cdc_uart.build.board=CDC_UART
Line.menu.com.cdc_uart.build.pid=0x0557
Line.menu.com.cdc_hid_uart=CDC_HID_UART
Line.menu.com.cdc_hid_uart.build.board=CDC_HID_UART
Line.menu.com.cdc_hid_uart.build.pid=0x0856
Line.menu.com.cdc_hid=CDC_HID
Line.menu.com.cdc_hid.build.board=CDC_HID
Line.menu.com.cdc_hid.build.pid=0x0856
Line.menu.com.cdc=CDC_ONLY
Line.menu.com.cdc.build.board=CDC_ONLY
Line.menu.com.cdc.build.pid=0x0557
Line.menu.com.cdc_midi_hid_uart=CDC_MIDI_HID_UART
Line.menu.com.cdc_midi_hid_uart.build.board=CDC_MIDI_HID_UART
Line.menu.com.cdc_midi_hid_uart.build.pid=0x0B34

Line.menu.com.uart=UART_ONLY
Line.menu.com.uart.build.board=UART_ONLY
Line.menu.com.uart.build.pid=0x0856
Line.menu.com.none=USB_UART_DISABLED
Line.menu.com.none.build.board=USB_UART_DISABLED
Line.menu.com.none.build.pid=0x0856
Line.menu.usb.none=USB_DISABLED
Line.menu.usb.none.build.usbcom=USB_DISABLED
Line.menu.usb.none.build.pid=0x0856


Line.build.mcu=cortex-m0plus
Line.build.f_cpu=48000000L

Line.bootloader.tool=Jlink

Line.upload.tool=bossac
Line.upload.protocol=sam-ba
Line.upload.use_1200bps_touch=true
Line.upload.wait_for_upload_port=true
Line.upload.native_usb=true

#Line.menu.serial.default_uart_wire_spi=DEFAULT(Line)
#Line.menu.serial.default_uart_wire_spi.build.serialcom_uart=SIX_UART
#Line.menu.serial.default_uart_wire_spi.build.serialcom_wire=ONE_WIRE
#Line.menu.serial.default_uart_wire_spi.build.serialcom_spi=TWO_SPI
Line.build.serialcom_uart=SIX_UART
Line.build.serialcom_wire=ONE_WIRE
Line.build.serialcom_spi=TWO_SPI







